Documents/НачислениеВебМастерам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>НачислениеВебМастерам</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.НачисленияВебМастерам</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчётыСВебМастерами</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Начисления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВебМастер</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВебМастера</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Кампания</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РекламныеКампании</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Оффер</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Офферы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Лиды</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Депозиты</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДепозитов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ставка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаУпр</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/НачислениеВебМастерам/Ext/ManagerModule.bsl
Функция СформироватьПечатнуюФорму(ДокументСсылка) Экспорт
	
	Макет = Документы.НачислениеВебМастерам.ПолучитьМакет("МакетНачисления");
	ТабДок = Новый ТабличныйДокумент;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НачислениеВебМастерам.Номер КАК Номер,
	|	НачислениеВебМастерам.Дата КАК Дата,
	|	НачислениеВебМастерам.ДатаНачала КАК ДатаНачала,
	|	НачислениеВебМастерам.ДатаОкончания КАК ДатаОкончания
	|ИЗ
	|	Документ.НачислениеВебМастерам КАК НачислениеВебМастерам
	|ГДЕ
	|	НачислениеВебМастерам.Ссылка = &Ссылка
	|;
	|
	|ВЫБРАТЬ
	|	Начисления.ВебМастер КАК ВебМастер,
	|	Начисления.Кампания КАК Кампания,
	|	Начисления.Оффер КАК Оффер,
	|	Начисления.Лиды КАК Лиды,
	|	Начисления.Депозиты КАК Депозиты,
	|	Начисления.Ставка КАК Ставка,
	|	Начисления.СуммаУпр КАК СуммаУпр
	|ИЗ
	|	Документ.НачислениеВебМастерам.Начисления КАК Начисления
	|ГДЕ
	|	Начисления.Ссылка = &Ссылка";
	Результаты = Запрос.ВыполнитьПакет();
	
	Шапка = Результаты[0].Выбрать();
	Если Не Шапка.Следующий() Тогда
		Возврат ТабДок;
	КонецЕсли;
	
	Область = Макет.ПолучитьОбласть("Заголовок");
	Область.Параметры.Номер = Шапка.Номер;
	Область.Параметры.Дата = Формат(Шапка.Дата, "ДЛФ=D");
	Область.Параметры.ДатаНачала = Формат(Шапка.ДатаНачала, "ДЛФ=D");
	Область.Параметры.ДатаОкончания = Формат(Шапка.ДатаОкончания, "ДЛФ=D");
	Область.Параметры.Валюта = Константы.УправленческаяВалюта.Получить();
	ТабДок.Вывести(Область);
	
	ТабДок.Вывести(Макет.ПолучитьОбласть("ШапкаТаблицы"));
	
	ЛидыИтого = 0;
	ДепозитыИтого = 0;
	СуммаИтого = 0;
	Выборка = Результаты[1].Выбрать();
	Пока Выборка.Следующий() Цикл
		Область = Макет.ПолучитьОбласть("Строка");
		Область.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Область);
		ЛидыИтого = ЛидыИтого + Выборка.Лиды;
		ДепозитыИтого = ДепозитыИтого + Выборка.Депозиты;
		СуммаИтого = СуммаИтого + Выборка.СуммаУпр;
	КонецЦикла;
	
	Область = Макет.ПолучитьОбласть("Итого");
	Область.Параметры.ЛидыИтого = ЛидыИтого;
	Область.Параметры.ДепозитыИтого = ДепозитыИтого;
	Область.Параметры.СуммаИтого = СуммаИтого;
	ТабДок.Вывести(Область);
	ТабДок.Вывести(Макет.ПолучитьОбласть("Подвал"));
	
	ТабДок.Область(1, 1, 1, 1).ШиринаКолонки = 25;
	ТабДок.Область(1, 2, 1, 2).ШиринаКолонки = 25;
	ТабДок.Область(1, 3, 1, 3).ШиринаКолонки = 20;
	ТабДок.Область(1, 4, 1, 4).ШиринаКолонки = 8;
	ТабДок.Область(1, 5, 1, 5).ШиринаКолонки = 10;
	ТабДок.Область(1, 6, 1, 6).ШиринаКолонки = 10;
	ТабДок.Область(1, 7, 1, 7).ШиринаКолонки = 15;
	
	Возврат ТабДок;
	
КонецФункции
